Documents/РемонтыАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>РемонтыАвтомобилей</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ФинансовыйРезультат</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСПоставщиками</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровНаСкладах</xr:Item>
				<xr:Item>InformationRegister.ПоказанияСпидометра</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Машины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРемонта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРемонтовАвтотранспорта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОперацииДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказанияСпидометра</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавитьПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавитьКомментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВыполненныеРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРабот</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРаботПоРемонтуАвтотранспорта</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦелоеНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИспользованныеЗапчасти</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Запчасть</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтранаПроизводитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Страны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФирмаПроизводитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Производители</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Качество</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Качество</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидИспользованойЗапчасти</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыИспользованныхЗапчастей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьРасходыПоРемонту</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Затрата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ВзаиморасчетыСПоставщиками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСПоставщиками</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВал</Name>
					<Comment>Сумма в валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КорСчет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Внутренний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КредитныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтделыВМагазинах</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Внутренний</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделительУчёта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделителиУчёта</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ФинансовыйРезультат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<AccumulationRegister>
		<Properties>
			<Name>ФинансовыйРезультат</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаДоходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРасходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КорСчет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Внутренний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДоходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтделыВМагазинах</v8:Type>
						<v8:Type>cfg:CatalogRef.Машины</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделительУчёта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделителиУчёта</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Внутренний</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ПартииТоваровНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииТоваровНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПродСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьВал</Name>
					<Comment>Сумма в валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УдалитьКатегория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорСчет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Внутренний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтделыВМагазинах</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Внутренний</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидХранения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыХраненияЗапасов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МОЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделительУчёта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделителиУчёта</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыИспользованныхЗапчастей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>ВидыИспользованныхЗапчастей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Покупные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собственные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/РемонтыАвтомобилей/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(отказ, режимПроведения)
	
	Движения.ВзаиморасчетыСПоставщиками.Записывать = Истина;
	Движения.ФинансовыйРезультат.Записывать = Истина;
	Движения.ПартииТоваровНаСкладах.Записывать = Истина;
	
	Движения.ВзаиморасчетыСПоставщиками.Очистить();
	Движения.ФинансовыйРезультат.Очистить();
	
	Если ОперацияДокумента = Справочники.ОперацииДокументов.АктНаРемонтАвтомобиля Тогда
		
		запрос = Новый Запрос;
		
		#Область ТекстЗапроса
		
		запрос.Текст =
		"ВЫБРАТЬ
		|	РемонтыАвтомобилейВыполненныеРаботы.Ссылка,
		|	РемонтыАвтомобилейВыполненныеРаботы.Ссылка.Дата КАК Период,
		|	РемонтыАвтомобилейВыполненныеРаботы.Ссылка.Контрагент,
		|	РемонтыАвтомобилейВыполненныеРаботы.Ссылка.Подразделение,
		|	РемонтыАвтомобилейВыполненныеРаботы.Ссылка.Автомобиль КАК Объект,
		|	ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.РемонтыАвтомобилей) КАК СтатьяЗатрат,
		|	РемонтыАвтомобилейВыполненныеРаботы.Сумма,
		|	ВалютаУчета.Значение КАК Валюта,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыИспользованныхЗапчастей.Покупные) КАК ВидИспользования,
		|	РемонтыАвтомобилейВыполненныеРаботы.ВидРабот КАК Номенклатура,
		|	ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка) КАК Склад,
		|	РемонтыАвтомобилейВыполненныеРаботы.Количество
		|ПОМЕСТИТЬ ВТ_ТаблицаДокумента
		|ИЗ
		|	Документ.РемонтыАвтомобилей.ВыполненныеРаботы КАК РемонтыАвтомобилейВыполненныеРаботы,
		|	Константа.ВалютаУчета КАК ВалютаУчета
		|ГДЕ
		|	РемонтыАвтомобилейВыполненныеРаботы.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РемонтыАвтомобилейИспользованныеЗапчасти.Ссылка,
		|	РемонтыАвтомобилейИспользованныеЗапчасти.Ссылка.Дата,
		|	РемонтыАвтомобилейИспользованныеЗапчасти.Ссылка.Контрагент,
		|	РемонтыАвтомобилейИспользованныеЗапчасти.Ссылка.Подразделение,
		|	РемонтыАвтомобилейИспользованныеЗапчасти.Ссылка.Автомобиль,
		|	ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.РасходыНаЗапчасти),
		|	РемонтыАвтомобилейИспользованныеЗапчасти.Сумма,
		|	ВалютаУчета.Значение,
		|	РемонтыАвтомобилейИспользованныеЗапчасти.ВидИспользованойЗапчасти,
		|	РемонтыАвтомобилейИспользованныеЗапчасти.Запчасть,
		|	РемонтыАвтомобилейИспользованныеЗапчасти.Запчасть.Родитель.Склад,
		|	РемонтыАвтомобилейИспользованныеЗапчасти.Количество
		|ИЗ
		|	Документ.РемонтыАвтомобилей.ИспользованныеЗапчасти КАК РемонтыАвтомобилейИспользованныеЗапчасти,
		|	Константа.ВалютаУчета КАК ВалютаУчета
		|ГДЕ
		|	РемонтыАвтомобилейИспользованныеЗапчасти.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ВТ_ТаблицаДокумента.Период,
		|	ВТ_ТаблицаДокумента.Подразделение,
		|	ВТ_ТаблицаДокумента.Контрагент,
		|	СУММА(ВТ_ТаблицаДокумента.Сумма) КАК Сумма,
		|	ВТ_ТаблицаДокумента.Валюта
		|ИЗ
		|	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
		|ГДЕ
		|	ВТ_ТаблицаДокумента.Сумма <> 0
		|	И ВТ_ТаблицаДокумента.ВидИспользования = ЗНАЧЕНИЕ(Перечисление.ВидыИспользованныхЗапчастей.Покупные)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ТаблицаДокумента.Контрагент,
		|	ВТ_ТаблицаДокумента.Подразделение,
		|	ВТ_ТаблицаДокумента.Период,
		|	ВТ_ТаблицаДокумента.Валюта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТаблицаДокумента.Период,
		|	ВТ_ТаблицаДокумента.Подразделение,
		|	ВТ_ТаблицаДокумента.СтатьяЗатрат,
		|	ВТ_ТаблицаДокумента.Объект,
		|	СУММА(ВТ_ТаблицаДокумента.Сумма) КАК СуммаРасходов
		|ИЗ
		|	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
		|ГДЕ
		|	ВТ_ТаблицаДокумента.Сумма <> 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ТаблицаДокумента.Период,
		|	ВТ_ТаблицаДокумента.Подразделение,
		|	ВТ_ТаблицаДокумента.СтатьяЗатрат,
		|	ВТ_ТаблицаДокумента.Объект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	ВТ_ТаблицаДокумента.Период,
		|	ВТ_ТаблицаДокумента.Подразделение,
		|	ВТ_ТаблицаДокумента.Склад,
		|	ВТ_ТаблицаДокумента.Номенклатура,
		|	ЗНАЧЕНИЕ(ПланСчетов.Внутренний.ЗапасныеЧасти) КАК СчетУчета,
		|	ВТ_ТаблицаДокумента.Валюта,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыХраненияЗапасов.НаСкладе) КАК ВидХранения,
		|	ВТ_ТаблицаДокумента.Количество,
		|	ВТ_ТаблицаДокумента.Сумма КАК Стоимость,
		|	ВТ_ТаблицаДокумента.Сумма КАК СтоимостьВал,
		|	ЗНАЧЕНИЕ(ПланСчетов.Внутренний.Затраты) КАК КорСчет
		|ИЗ
		|	ВТ_ТаблицаДокумента КАК ВТ_ТаблицаДокумента
		|ГДЕ
		|	ВТ_ТаблицаДокумента.ВидИспользования = ЗНАЧЕНИЕ(Перечисление.ВидыИспользованныхЗапчастей.Собственные)
		|	И ВТ_ТаблицаДокумента.Сумма <> 0";
		
		#КонецОбласти 
		
		запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		результатЗапроса = запрос.ВыполнитьПакет();
		
		Движения.ВзаиморасчетыСПоставщиками.Загрузить(результатЗапроса[1].Выгрузить());
		Движения.ФинансовыйРезультат.Загрузить(результатЗапроса[2].Выгрузить());
		Движения.ПартииТоваровНаСкладах.Загрузить(результатЗапроса[3].Выгрузить());
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(отказ, режимЗаписи, режимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Подразделение.Пустая() Тогда
		
		ТекстСообщения = НСтр("ru = 'Запись невозможна без заполнения Подразделения.'");
		ПроверкаДанныхКлиентСервер.СообщитьОбОшибке(отказ, текстСообщения, ЭтотОбъект, "Подразделение");
		
	КонецЕсли;
	
	Если ПоказанияСпидометра = 0 Тогда
		
		ТекстСообщения = НСтр("ru = 'Запись невозможна без заполнения показания спидометра.'");
		ПроверкаДанныхКлиентСервер.СообщитьОбОшибке(отказ, текстСообщения, ЭтотОбъект, "ПоказанияСпидометра");
		
	КонецЕсли;
	
	СуммаДокумента = ОбщегоНазначенияСервер.ПолучитьСуммуДокумента(ЭтотОбъект, "ВыполненныеРаботы,ИспользованныеЗапчасти");

КонецПроцедуры

Процедура ПриКопировании(объектКопирования)
	
	ЗаполнениеОбъектовСервер.ЗаполнитьДанныеСкопированногоДокумента(ЭтотОбъект, объектКопирования);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(отказ, проверяемыеРеквизиты)
	
	Если ОперацияДокумента = Справочники.ОперацииДокументов.АктНаРемонтАвтомобиля Тогда
		
		проверяемыеРеквизиты.Добавить("Контрагент");
		проверяемыеРеквизиты.Добавить("ИспользованныеЗапчасти.ВидИспользованойЗапчасти");
		проверяемыеРеквизиты.Добавить("ИспользованныеЗапчасти.Запчасть");
		
	КонецЕсли;
	
	
КонецПроцедуры
	
#КонецОбласти
